/*
  文件名称: AK_Mutex.h
  Copyright (c) 2009 Aerospace Information. Co., Ltd.
  作	者: heli@aisino.com
  创建日期: 2009-7-08
  描	述: 定义用于多线程访问的互斥访问函数
*/

#ifndef _AK_MUTEX_H_
#define _AK_MUTEX_H_



//==============================================================
//函数名称:		AK_CreateMutex
//函数参数:		pMutexName[in]:互斥量名；若为无名互斥量，则为NULL
//				ppMutex[out]: 互斥锁
//返回值:	    0: 成功
//				其他:	失败	
//函数功能:     创建一个互斥锁
//==============================================================
int AK_CreateMutex(char* pMutexName, void** ppMutex);

//==============================================================
//函数名称:		AK_LockMutex
//函数参数:		pMutex[in]: 互斥锁   
//返回值:	    CKR_OK: 成功
//				其他:	失败	
//函数功能:     锁定一个互斥锁
//==============================================================
int AK_LockMutex(void* pMutex);

//==============================================================
//函数名称:		AK_UnlockMutex
//函数参数:		pMutex[in]: 互斥锁   
//返回值:	    CKR_OK: 成功
//				其他:	失败	
//函数功能:     解锁一个互斥锁
//==============================================================
int AK_UnlockMutex(void* pMutex);

//==============================================================
//函数名称:		AK_DestroyMutex
//函数参数:		pMutex[in]: 互斥锁   
//返回值:	    CKR_OK: 成功
//				其他:	失败	
//函数功能:     销毁一个互斥锁
//==============================================================
int AK_DestroyMutex(void* pMutex);

#endif